In [1]:
import pandas as pd
from datetime import datetime
import os
score = pd.read_csv("scores.csv", index_col=0)
score

   Position    Name  Fruits                 Date
0         0  filipe      10  2024-01-10 14:48:49
1         0  filipe      12  2024-01-10 14:49:33
2         0  filipe      12  2024-01-10 14:54:22
3         0  filipe      12  2024-01-10 14:55:10
4         0  filipe       2  2024-01-10 14:55:37

In [2]:
new_score = {"Position":[0], "Name":["filipe"], "Fruits":[2],"Date":[datetime.now().strftime("%Y-%m-%d %H:%M:%S")]}
df = pd.DataFrame(new_score)
df

   Position    Name  Fruits                 Date
0         0  filipe       2  2024-01-10 15:17:48

In [3]:
score = pd.concat([score, df],ignore_index=True,axis=0)
score

   Position    Name  Fruits                 Date
0         0  filipe      10  2024-01-10 14:48:49
1         0  filipe      12  2024-01-10 14:49:33
2         0  filipe      12  2024-01-10 14:54:22
3         0  filipe      12  2024-01-10 14:55:10
4         0  filipe       2  2024-01-10 14:55:37
5         0  filipe       2  2024-01-10 15:17:48

In [4]:
score = score.sort_values(by="Date", ascending=False).sort_values(by="Fruits", ascending=False)
score

   Position    Name  Fruits                 Date
3         0  filipe      12  2024-01-10 14:55:10
2         0  filipe      12  2024-01-10 14:54:22
1         0  filipe      12  2024-01-10 14:49:33
0         0  filipe      10  2024-01-10 14:48:49
5         0  filipe       2  2024-01-10 15:17:48
4         0  filipe       2  2024-01-10 14:55:37

In [5]:
score = score.head(5)
score

   Position    Name  Fruits                 Date
3         0  filipe      12  2024-01-10 14:55:10
2         0  filipe      12  2024-01-10 14:54:22
1         0  filipe      12  2024-01-10 14:49:33
0         0  filipe      10  2024-01-10 14:48:49
5         0  filipe       2  2024-01-10 15:17:48

In [6]:
score.reset_index(inplace=True,drop = True)
score

   Position    Name  Fruits                 Date
0         0  filipe      12  2024-01-10 14:55:10
1         0  filipe      12  2024-01-10 14:54:22
2         0  filipe      12  2024-01-10 14:49:33
3         0  filipe      10  2024-01-10 14:48:49
4         0  filipe       2  2024-01-10 15:17:48

In [7]:
score.reset_index(inplace=True)
score

   index  Position    Name  Fruits                 Date
0      0         0  filipe      12  2024-01-10 14:55:10
1      1         0  filipe      12  2024-01-10 14:54:22
2      2         0  filipe      12  2024-01-10 14:49:33
3      3         0  filipe      10  2024-01-10 14:48:49
4      4         0  filipe       2  2024-01-10 15:17:48

In [8]:
score = score.drop('Position', axis=1)
score

   index    Name  Fruits                 Date
0      0  filipe      12  2024-01-10 14:55:10
1      1  filipe      12  2024-01-10 14:54:22
2      2  filipe      12  2024-01-10 14:49:33
3      3  filipe      10  2024-01-10 14:48:49
4      4  filipe       2  2024-01-10 15:17:48

In [9]:
score.rename(columns={'index': 'Position'}, inplace=True)
score

   Position    Name  Fruits                 Date
0         0  filipe      12  2024-01-10 14:55:10
1         1  filipe      12  2024-01-10 14:54:22
2         2  filipe      12  2024-01-10 14:49:33
3         3  filipe      10  2024-01-10 14:48:49
4         4  filipe       2  2024-01-10 15:17:48

In [10]:
print(error)

NameError: name 'error' is not defined

In [11]:
score.Position = score.Position.map(lambda p: p + 1)
score

   Position    Name  Fruits                 Date
0         1  filipe      12  2024-01-10 14:55:10
1         2  filipe      12  2024-01-10 14:54:22
2         3  filipe      12  2024-01-10 14:49:33
3         4  filipe      10  2024-01-10 14:48:49
4         5  filipe       2  2024-01-10 15:17:48

In [12]:
score.to_csv("scores.csv")